Revit 2027 API
UIMacroManager.RemoveModule Method
 Removes a MacroModule.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveModule(
	MacroModule module
)
Public Sub RemoveModule (
	module As MacroModule
)
public:
void RemoveModule(
	MacroModule^ module
)
member RemoveModule :
        module : MacroModule -> unit
Parameters
module MacroModule
 The module will be removed.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace